zephyrproject-rtos/hal_microchip/packs/sam/sam_d5x_e5x/atsame51/include/component/pac.h
#define PAC_STATUSC_CAN_Pos                   _UINT32_(0)                                          /* (PAC_STATUSC Position) CANx APB Protect Enable */
#define PAC_STATUSC_CAN_Msk                   (_UINT32_(0x3) << PAC_STATUSC_CAN_Pos)               /* (PAC_STATUSC Mask) CAN */
#define PAC_STATUSC_CAN(value)                (PAC_STATUSC_CAN_Msk & (_UINT32_(value) << PAC_STATUSC_CAN_Pos)) 
#define PAC_STATUSC_TCC_Pos                   _UINT32_(3)                                          /* (PAC_STATUSC Position) TCC2 APB Protect Enable */
#define PAC_STATUSC_TCC_Msk                   (_UINT32_(0x3) << PAC_STATUSC_TCC_Pos)               /* (PAC_STATUSC Mask) TCC */
#define PAC_STATUSC_TCC(value)                (PAC_STATUSC_TCC_Msk & (_UINT32_(value) << PAC_STATUSC_TCC_Pos)) 
#define PAC_STATUSC_TC_Pos                    _UINT32_(5)                                          /* (PAC_STATUSC Position) TC4 APB Protect Enable */
#define PAC_STATUSC_TC_Msk                    (_UINT32_(0x3) << PAC_STATUSC_TC_Pos)                /* (PAC_STATUSC Mask) TC */
#define PAC_STATUSC_TC(value)                 (PAC_STATUSC_TC_Msk & (_UINT32_(value) << PAC_STATUSC_TC_Pos)) 

/* -------- PAC_STATUSD : (PAC Offset: 0x40) ( R/ 32) Peripheral write protection status - Bridge D -------- */
#define PAC_STATUSD_RESETVALUE                _UINT32_(0x00)                                       /*  (PAC_STATUSD) Peripheral write protection status - Bridge D  Reset Value */

#define PAC_STATUSD_SERCOM4_Pos               _UINT32_(0)                                          /* (PAC_STATUSD) SERCOM4 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM4_Msk               (_UINT32_(0x1) << PAC_STATUSD_SERCOM4_Pos)           /* (PAC_STATUSD) SERCOM4 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM4(value)            (PAC_STATUSD_SERCOM4_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM4_Pos)) /* Assigment of value for SERCOM4 in the PAC_STATUSD register */
#define PAC_STATUSD_SERCOM5_Pos               _UINT32_(1)                                          /* (PAC_STATUSD) SERCOM5 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM5_Msk               (_UINT32_(0x1) << PAC_STATUSD_SERCOM5_Pos)           /* (PAC_STATUSD) SERCOM5 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM5(value)            (PAC_STATUSD_SERCOM5_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM5_Pos)) /* Assigment of value for SERCOM5 in the PAC_STATUSD register */
#define PAC_STATUSD_SERCOM6_Pos               _UINT32_(2)                                          /* (PAC_STATUSD) SERCOM6 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM6_Msk               (_UINT32_(0x1) << PAC_STATUSD_SERCOM6_Pos)           /* (PAC_STATUSD) SERCOM6 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM6(value)            (PAC_STATUSD_SERCOM6_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM6_Pos)) /* Assigment of value for SERCOM6 in the PAC_STATUSD register */
#define PAC_STATUSD_SERCOM7_Pos               _UINT32_(3)                                          /* (PAC_STATUSD) SERCOM7 APB Protect Enable Position */
#define PAC_STATUSD_SERCOM7_Msk               (_UINT32_(0x1) << PAC_STATUSD_SERCOM7_Pos)           /* (PAC_STATUSD) SERCOM7 APB Protect Enable Mask */
#define PAC_STATUSD_SERCOM7(value)            (PAC_STATUSD_SERCOM7_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM7_Pos)) /* Assigment of value for SERCOM7 in the PAC_STATUSD register */
#define PAC_STATUSD_TCC4_Pos                  _UINT32_(4)                                          /* (PAC_STATUSD) TCC4 APB Protect Enable Position */
#define PAC_STATUSD_TCC4_Msk                  (_UINT32_(0x1) << PAC_STATUSD_TCC4_Pos)              /* (PAC_STATUSD) TCC4 APB Protect Enable Mask */
#define PAC_STATUSD_TCC4(value)               (PAC_STATUSD_TCC4_Msk & (_UINT32_(value) << PAC_STATUSD_TCC4_Pos)) /* Assigment of value for TCC4 in the PAC_STATUSD register */
#define PAC_STATUSD_TC6_Pos                   _UINT32_(5)                                          /* (PAC_STATUSD) TC6 APB Protect Enable Position */
#define PAC_STATUSD_TC6_Msk                   (_UINT32_(0x1) << PAC_STATUSD_TC6_Pos)               /* (PAC_STATUSD) TC6 APB Protect Enable Mask */
#define PAC_STATUSD_TC6(value)                (PAC_STATUSD_TC6_Msk & (_UINT32_(value) << PAC_STATUSD_TC6_Pos)) /* Assigment of value for TC6 in the PAC_STATUSD register */
#define PAC_STATUSD_TC7_Pos                   _UINT32_(6)                                          /* (PAC_STATUSD) TC7 APB Protect Enable Position */
#define PAC_STATUSD_TC7_Msk                   (_UINT32_(0x1) << PAC_STATUSD_TC7_Pos)               /* (PAC_STATUSD) TC7 APB Protect Enable Mask */
#define PAC_STATUSD_TC7(value)                (PAC_STATUSD_TC7_Msk & (_UINT32_(value) << PAC_STATUSD_TC7_Pos)) /* Assigment of value for TC7 in the PAC_STATUSD register */
#define PAC_STATUSD_ADC0_Pos                  _UINT32_(7)                                          /* (PAC_STATUSD) ADC0 APB Protect Enable Position */
#define PAC_STATUSD_ADC0_Msk                  (_UINT32_(0x1) << PAC_STATUSD_ADC0_Pos)              /* (PAC_STATUSD) ADC0 APB Protect Enable Mask */
#define PAC_STATUSD_ADC0(value)               (PAC_STATUSD_ADC0_Msk & (_UINT32_(value) << PAC_STATUSD_ADC0_Pos)) /* Assigment of value for ADC0 in the PAC_STATUSD register */
#define PAC_STATUSD_ADC1_Pos                  _UINT32_(8)                                          /* (PAC_STATUSD) ADC1 APB Protect Enable Position */
#define PAC_STATUSD_ADC1_Msk                  (_UINT32_(0x1) << PAC_STATUSD_ADC1_Pos)              /* (PAC_STATUSD) ADC1 APB Protect Enable Mask */
#define PAC_STATUSD_ADC1(value)               (PAC_STATUSD_ADC1_Msk & (_UINT32_(value) << PAC_STATUSD_ADC1_Pos)) /* Assigment of value for ADC1 in the PAC_STATUSD register */
#define PAC_STATUSD_DAC_Pos                   _UINT32_(9)                                          /* (PAC_STATUSD) DAC APB Protect Enable Position */
#define PAC_STATUSD_DAC_Msk                   (_UINT32_(0x1) << PAC_STATUSD_DAC_Pos)               /* (PAC_STATUSD) DAC APB Protect Enable Mask */
#define PAC_STATUSD_DAC(value)                (PAC_STATUSD_DAC_Msk & (_UINT32_(value) << PAC_STATUSD_DAC_Pos)) /* Assigment of value for DAC in the PAC_STATUSD register */
#define PAC_STATUSD_I2S_Pos                   _UINT32_(10)                                         /* (PAC_STATUSD) I2S APB Protect Enable Position */
#define PAC_STATUSD_I2S_Msk                   (_UINT32_(0x1) << PAC_STATUSD_I2S_Pos)               /* (PAC_STATUSD) I2S APB Protect Enable Mask */
#define PAC_STATUSD_I2S(value)                (PAC_STATUSD_I2S_Msk & (_UINT32_(value) << PAC_STATUSD_I2S_Pos)) /* Assigment of value for I2S in the PAC_STATUSD register */
#define PAC_STATUSD_PCC_Pos                   _UINT32_(11)                                         /* (PAC_STATUSD) PCC APB Protect Enable Position */
#define PAC_STATUSD_PCC_Msk                   (_UINT32_(0x1) << PAC_STATUSD_PCC_Pos)               /* (PAC_STATUSD) PCC APB Protect Enable Mask */
#define PAC_STATUSD_PCC(value)                (PAC_STATUSD_PCC_Msk & (_UINT32_(value) << PAC_STATUSD_PCC_Pos)) /* Assigment of value for PCC in the PAC_STATUSD register */
#define PAC_STATUSD_Msk                       _UINT32_(0x00000FFF)                                 /* (PAC_STATUSD) Register Mask  */

#define PAC_STATUSD_SERCOM_Pos                _UINT32_(0)                                          /* (PAC_STATUSD Position) SERCOM4 APB Protect Enable */
#define PAC_STATUSD_SERCOM_Msk                (_UINT32_(0xF) << PAC_STATUSD_SERCOM_Pos)            /* (PAC_STATUSD Mask) SERCOM */
#define PAC_STATUSD_SERCOM(value)             (PAC_STATUSD_SERCOM_Msk & (_UINT32_(value) << PAC_STATUSD_SERCOM_Pos)) 
#define PAC_STATUSD_TCC_Pos                   _UINT32_(4)                                          /* (PAC_STATUSD Position) TCC4 APB Protect Enable */
#define PAC_STATUSD_TCC_Msk                   (_UINT32_(0x1) << PAC_STATUSD_TCC_Pos)               /* (PAC_STATUSD Mask) TCC */
#define PAC_STATUSD_TCC(value)                (PAC_STATUSD_TCC_Msk & (_UINT32_(value) << PAC_STATUSD_TCC_Pos)) 
#define PAC_STATUSD_TC_Pos                    _UINT32_(5)                                          /* (PAC_STATUSD Position) TC6 APB Protect Enable */
#define PAC_STATUSD_TC_Msk                    (_UINT32_(0x3) << PAC_STATUSD_TC_Pos)                /* (PAC_STATUSD Mask) TC */
#define PAC_STATUSD_TC(value)                 (PAC_STATUSD_TC_Msk & (_UINT32_(value) << PAC_STATUSD_TC_Pos)) 
#define PAC_STATUSD_ADC_Pos                   _UINT32_(7)                                          /* (PAC_STATUSD Position) ADCx APB Protect Enable */
#define PAC_STATUSD_ADC_Msk                   (_UINT32_(0x3) << PAC_STATUSD_ADC_Pos)               /* (PAC_STATUSD Mask) ADC */
#define PAC_STATUSD_ADC(value)                (PAC_STATUSD_ADC_Msk & (_UINT32_(value) << PAC_STATUSD_ADC_Pos)) 

/** \brief PAC register offsets definitions */
#define PAC_WRCTRL_REG_OFST            _UINT32_(0x00)      /* (PAC_WRCTRL) Write control Offset */
#define PAC_EVCTRL_REG_OFST            _UINT32_(0x04)      /* (PAC_EVCTRL) Event control Offset */
#define PAC_INTENCLR_REG_OFST          _UINT32_(0x08)      /* (PAC_INTENCLR) Interrupt enable clear Offset */
#define PAC_INTENSET_REG_OFST          _UINT32_(0x09)      /* (PAC_INTENSET) Interrupt enable set Offset */
#define PAC_INTFLAGAHB_REG_OFST        _UINT32_(0x10)      /* (PAC_INTFLAGAHB) Bridge interrupt flag status Offset */
#define PAC_INTFLAGA_REG_OFST          _UINT32_(0x14)      /* (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A Offset */
#define PAC_INTFLAGB_REG_OFST          _UINT32_(0x18)      /* (PAC_INTFLAGB) Peripheral interrupt flag status - Bridge B Offset */
#define PAC_INTFLAGC_REG_OFST          _UINT32_(0x1C)      /* (PAC_INTFLAGC) Peripheral interrupt flag status - Bridge C Offset */
#define PAC_INTFLAGD_REG_OFST          _UINT32_(0x20)      /* (PAC_INTFLAGD) Peripheral interrupt flag status - Bridge D Offset */
#define PAC_STATUSA_REG_OFST           _UINT32_(0x34)      /* (PAC_STATUSA) Peripheral write protection status - Bridge A Offset */
#define PAC_STATUSB_REG_OFST           _UINT32_(0x38)      /* (PAC_STATUSB) Peripheral write protection status - Bridge B Offset */
#define PAC_STATUSC_REG_OFST           _UINT32_(0x3C)      /* (PAC_STATUSC) Peripheral write protection status - Bridge C Offset */
#define PAC_STATUSD_REG_OFST           _UINT32_(0x40)      /* (PAC_STATUSD) Peripheral write protection status - Bridge D Offset */

